package com.szhengzhu.core;

/**
 * 枚举型自定义状态码，方便调试 
 * 4** : 客户端异常 
 * 5** : 服务端异常
 * 
 * @author Administrator
 * @date 2019年2月20日
 */
public enum StatusCode {

    _4000("4000", "手机号码格式不对!"), 
    _4001("4001", "操作频繁，请稍后再试！"),
    _4002("4002", "验证码错误！"),
    _4003("4003", "验证码超时！"),
    _4004("4004", "提交数据有误，请重试！"),
    _4005("4005", "用户未登录！"),
    _4006("4006", "时间过期，无法设置与修改节假日！"),
    _4007("4007", "数据已存在！"),
    _4008("4008", "数据不存在！"),
    _4009("4009", "图片上传失败！"),
    _4010("4010", "配送日期不可以为节假日！"),
    _4011("4011", "该用户不存在！"),
    _4012("4012", "该用户未绑定！"),
    _4013("4013", "TOKEN失效！"),
    _4014("4014", "订单号有误！"),
    _5000("5000", "服务器异常！"),
    _5001("5001", "验证码发送失败！"),
    _5002("5002", "该用户不存在！"),
    _5003("5003", "库存商品不存在，请维护库存！"),
    _5004("5004", "无效code,请重新获取！"),  
    _5005("5005", "文件格式不允许！"),
    _5006("5006", "该订单不是可支付订单！"),
    _5007("5007", "该团单已结束，请选择其他团单进行拼团！"),
    _5008("5008", "同一规格名不可以设置多个默认值！"),   
    _5009("5009", " 优惠券创建失败！"),
    _5010("5010", "服务器数据加载中…"),
    _5011("5011", "商品已设置预上架，无法手动操作！"),
    _5012("5012", "无法进行状态更改！"),
    _5013("5013", "下单失败！"),
    _5014("5014", "支付超时，订单已取消！");
    
    public String code;
    public String msg;

    private StatusCode(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

}
